# **#53 Membuat kategori baru berdasarkan treshold (ambang batas)**

**Import Modules**

In [3]:
import pandas as pd

print(pd.__version__)

2.2.2

**Persiapan Data Frame**

In [7]:
d = {'hobi':['jogging', 'mancing', 'renang',
             'mancing', 'mancing', 'baca', 
             'baca', 'mancing', 'fotograsi', 
             'mancing', 'camping']}

df = pd.DataFrame(d)
df

         hobi
0     jogging
1     mancing
2      renang
3     mancing
4     mancing
5        baca
6        baca
7     mancing
8   fotograsi
9     mancing
10    camping

**Membuat kategori baru berdasarkan treshold (ambang batas)**

In [10]:
df['hobi'].value_counts()

hobi
mancing      5
baca         2
jogging      1
renang       1
fotograsi    1
camping      1
Name: count, dtype: int64

In [12]:
persentase = df['hobi'].value_counts(normalize=True)
persentase

hobi
mancing      0.454545
baca         0.181818
jogging      0.090909
renang       0.090909
fotograsi    0.090909
camping      0.090909
Name: proportion, dtype: float64

In [14]:
threshold = 0.1
hobi_lain = persentase[persentase < threshold].index
hobi_lain

Index(['jogging', 'renang', 'fotograsi', 'camping'], dtype='object', name='hobi')

In [16]:
df['hobi'] = df['hobi'].replace(hobi_lain, 'lainnya')
df['hobi']

0     lainnya
1     mancing
2     lainnya
3     mancing
4     mancing
5        baca
6        baca
7     mancing
8     lainnya
9     mancing
10    lainnya
Name: hobi, dtype: object

In [18]:
df['hobi'].value_counts(normalize=True)

hobi
mancing    0.454545
lainnya    0.363636
baca       0.181818
Name: proportion, dtype: float64

# **#54 Menyimpan Data Frame sebagai file CVS**

**Import Modules**

In [22]:
import pandas as pd

print(pd.__version__)

2.2.2

**Persiapan Data Frame**|

In [25]:
data = {'nama' : ['bayu', 'indra', 'devi', 'agni'],
        'jenis_kelamin' : ['L', 'L', 'P', 'L'],
        'usia' : [23, 21, 22, 25]}

df = pd.DataFrame(data)
df

    nama jenis_kelamin  usia
0   bayu             L    23
1  indra             L    21
2   devi             P    22
3   agni             L    25

**Menyimpan Data Frame sebagai file CSV**

In [ ]:
df.to_csv('data_peserta.csv)

In [ ]:
df = pd.read_cvs('data_peserta.csv')
df = pd.read_csv('data_peserta.csv', index_col = 0)

df

In [ ]:
df.to_csv('data_peserta.csv', index = False)
df = pd.read_csv('data_peserta.csv')
df

# **#55 Menghitung jumlah baris menurut kriteria tertentu**

**Import Modules**

In [34]:
import pandas as pd
import numpy as np 

print(pd.__version__)
print(np.__version__)

2.2.2
1.26.4

**Persiapan Data Frame**

In [37]:
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)),
                  columns = cols)
df

   A  B  C  D  E
0  6  6  2  4  7
1  5  7  8  8  7
2  5  5  6  9  4
3  6  5  8  2  8
4  1  2  2  5  4
5  7  1  5  2  8
6  5  3  3  8  5
7  5  1  8  2  1
8  2  4  6  9  7
9  9  4  5  4  5

**Menghitung jumlah baris menurut kriteria tertentu**

In [40]:
(df['A'] <5).sum()

2

In [42]:
(df['A'] <5).mean()

0.2

# **#56 Mengeluarkan kolom dari Data Frame**

**Import Modules**

In [46]:
import pandas as pd

print(pd.__version__)

2.2.2

**Persiapan Data Frame**

In [49]:
data = {'nama' : ['bayu', 'indra', 'devi', 'agni'],
        'jenis_kelamin' : ['L', 'L', 'P', 'L'],
        'usia' : [23, 21, 22, 25]}

df = pd.DataFrame(data)
df

    nama jenis_kelamin  usia
0   bayu             L    23
1  indra             L    21
2   devi             P    22
3   agni             L    25

**Mengeluarkan kolom dari Data Frame**

In [ ]:
usia = df.pop('usia').to_frame()

In [62]:
df

    nama jenis_kelamin
0   bayu             L
1  indra             L
2   devi             P
3   agni             L

In [64]:
usia

   usia
0    23
1    21
2    22
3    25